---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteRegionOptionConflict
source: html/7d06684d-c3fe-5266-63b6-bd83da0c82ce.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteRegionOptionConflict Property

Subregions must be in the same Design Option as their Toposurface.

## Syntax (C#)
```csharp
public static FailureDefinitionId SiteRegionOptionConflict { get; }
```